<?php if (!defined('BASEPATH')) exit('No direct script access allowed');

$config['site']['basic'] = [
    // yn 텍스트 기본 값
    'def_yn_txt_cd' => [
        'Y'    => '사용',
        'N'    => '사용안함'
    ],
    // 전화번호 앞자리
    'phone_cd' => [
        ''      => '선택',
        '02'    => '서울[02]',
        '031'   => '경기[031]',
        '031'   => '경기[031]',
        '033'   => '강원[033]',
        '041'   => '충남[041]',
        '042'   => '대전[042]',
        '043'   => '충북[043]',
        '044'   => '세종[044]',
        '051'   => '부산[051]',
        '052'   => '울산[052]',
        '053'   => '대구[053]',
        '054'   => '경북[054]',
        '055'   => '경남[055]',
        '061'   => '전남[061]',
        '062'   => '광주[062]',
        '063'   => '전북[063]',
        '064'   => '제주[064]',
        '070'   => '070'
    ],
    // 휴대폰 앞자리
    'cellphone_cd'	=> [
        ''      => '선택',
        '010'   => '010',
        '011'   => '011',
        '016'   => '016',
        '017'   => '017',
        '019'   => '019'
    ],
    // 이메일 도메인
    'email_cd'	=> [
        ''      => '직접입력',
        'gmail.com' => 'gmail.com',
        'naver.com' => 'naver.com',
        'nate.com'  => 'nate.com'
    ],
    // 관심 분야
    'interest_cd' => [
        '10'    => '쇼핑',
        '20'    => '뮤직',
        '30'    => '영화'
    ],

    /*
    * 샘플 테이블(운영자) 리스트
    */
    // 접근유형(10:슈퍼관리자,11:부운영자,99:접근유형없음)
    'spmg_permit_cd'    => [
        '10'    => '슈퍼관리자',
        '11'    => '부운영자',
        '99'    => '접근유형없음'
    ],
    // 접근승인여부(10:승인,20:미승인,30:차단)
    'spmg_status_cd'    => [
        '10'    => '승인',
        '20'    => '미승인',
        '30'    => '차단'
    ],

    /**
     * 회원관리 > 회원리스트
     */
    // 회원 타입 (PU:일반, RM:동승매니저, DV:운행기사)
    'acmb_member_type_cd' => [
        'PU'    => '일반회원',
        'DV'    => '운전기사',
        'RM'    => '동승매니저'
    ]
     
];
